Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: This example creates key paths from Array<Int> to String and from String to Int, and then tries appending each to the other:
ja: この例は、Array<Int>からStringまでの、そしてStringからIntまでのキーパスを作成して、それからそれぞれを他とくっつけることを試みます：

source: This example creates three new values in the range 1...100.
ja: この例は、３つの新しい値を範囲1...100において作成します。

source: This example creates three new values in the range 1..<100.
ja: この例は、３つの新しい値を範囲1..<100において作成します。

source: This example creates three new values in the range 10.0 ... 20.0.
ja: この例は、３つの新しい値を範囲10.0 ... 20.0において作成します。

source: This example creates three new values in the range 10.0 ..< 20.0.
ja: この例は、３つの新しい値を範囲10.0 ..< 20.0において作成します。

source: This example defines an IntegerRef type with an @objc method named getIntegerValue().
ja: この例はIntegerRef型を、@objcメソッドでgetIntegerValue()と名付けられるものと共に定義します。

source: This example defines some simple macros in a C header:
ja: この例は、いくつかの単純なマクロをCヘッダにおいて定義します：

source: This example demonstrates getting a slice of an array of strings, finding the index of one of the strings in the slice, and then using that index in the original array.
ja: この例は文字列からなる配列のあるスライスの取得を実演します、スライスの中の文字列の１つのインデックスを見つけて、それからそのインデックスを元の配列において使います。

source: This example demonstrates that the characters view of a string returns the same characters in the same order whether the view’s indices or the view itself is being iterated.
ja: この例は、ある文字列のcharactersビューが、そのビューのインデックスであろうとビューそれ自体が反復されていようと同じ文字を同じ順序で返すのを実演します。

source: This example enumerates the characters of the string “Swift” and prints each character along with its place in the string.
ja: この例は文字列「Swift」の文字を列挙します、そして各文字をその文字列でのそれの場所とともに出力します。

source: This example finds the index of the last name that begins with the letter A:
ja: この例は、文字A:で始まる、最後の名前のインデックスを見つけます：

source: This example finds the largest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も大きな値を見つけます。

source: This example finds the smallest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も小さな値を見つけます。

source: This example iterates over the indices and elements of a set, building a list consisting of indices of names with five or fewer letters.
ja: この例は、ある集合のインデックスと要素のすべてにわたって反復します、５つまたはより少ない文字を持つ名前のインデックスから成るリストを作ります。

source: This example picks a name at random from an array:
ja: この例は、ある名前を無作為に配列から選出します。

source: This example prints the characters of a string in reverse order:
ja: この例は、ある文字列に属する文字を逆順で出力します。

source: This example removes all the vowels from a string:
ja: この例は、全ての母音を文字列から除去します：

source: This example removes three elements from the middle of an array of measurements.
ja: この例は、測定結果からなる配列の真ん中から３つの要素を削除します。

source: This example searches streetsSlice for one of the strings in the slice, and then uses that index in the original array.
ja: この例は、streetsSliceをスライスの中の文字列の１つについて検索して、それからそのインデックスを元々の配列において使います。

source: This example shows how a CollectionOfTwo instance can be created holding the values of a point, and then iterated over using a for-in loop.
ja: この例は、どのようにCollectionOfTwoインスタンスがある地点の値を保持して作成されるか、そしてそれからfor-inループを使って全体にわたって繰り返されるかを示します。

source: This example shows how an array of [Int] instances can be joined, using another [Int] instance as the separator:
ja: この例は、どのようにいくつかの[Int]インスタンスからなる配列が別の[Int]インスタンスを分離子として使ってつなぎ合わされるかを示します。

source: This example shows how an iterator can be used explicitly to emulate a for-in loop.
ja: この例は、イテレータが明示的に使われてfor-inループの機能を真似る方法を示します。

source: This example shows how to build a dictionary of letter frequencies of a string.
ja: この例は、ある文字列の文字頻度の辞書を作り上げる方法を示します。

source: This example shows how to catch errors from a particular error domain and bring attention to unhandled errors from other error domains:
ja: この例は、特定のエラー領域からのエラーをキャッチする、そして他のエラー領域からの処理できないエラーへの注意をもたらす方法を示します：

source: This example shows how to choose the current or new values for any duplicate keys:
ja: この例は、あらゆる重複キーに対して現在および新規の値を選択する方法を示します：

source: This example shows how to find the sum of an array of numbers.
ja: この例は、どのように数からなる配列の合計を見出すかを示します。

source: This example shows how to throw errors using that custom error type in Swift:
ja: この例は、そのあつらえのエラー型をSwiftで使って、エラーをスローする方法を示します：

source: This example shows how to use the max(by:) method on a dictionary to find the key-value pair with the highest value.
ja: この例は、max(by:)メソッドを辞書上で使って、最も高い値を持つキー値ペアを見つける方法を示します。

source: This example shows how to use the min(by:) method on a dictionary to find the key-value pair with the lowest value.
ja: この例は、min(by:)メソッドを辞書上で使って、最も低い値を持つキー値ペアを見つける方法を示します。

source: This example shows how you can check an array for an expense greater than $100.
ja: この例は、どのようにあなたが$100より大きい出費についてある配列を調べるかを示します。

source: This example shows how you can modify one of the names in an array of students.
ja: この例が示すのは、どうやってあなたが学生らの配列の中の名前の１つを修正できるかです。

source: This example shows several extending conversions of a negative value—note that negative values are sign-extended even when converting to an unsigned type.
ja: この例は、ある負の値のいくつかの拡張変換を示します — 符号なし型へ変換する時でさえ、負の値が符号拡張されることに注意してください。

source: This example shows the behavior on a little-endian platform.
ja: この例は、リトルエンディアンプラットホーム上での挙動を示します。

source: This example shows two overlapping ranges:
ja: この例は２つの重なった範囲を示します：

source: This example tests whether one countable range begins with the elements of another countable range.
ja: この例は、ある可付番範囲が別の可付番範囲の要素で始まるかどうかテストします。

source: This example tests whether one countable range shares the same elements as another countable range and an array.
ja: この例は、ある可付番範囲が同じ要素を別の可付番範囲とそしてある配列と共有するかどうかをテストします。

source: This example uses the last(where:) method to find the last negative number in an array of integers:
ja: この例は、last(where:)メソッドを使って、整数の配列において最後の負数を見つけます：

source: This example uses the lexicographicallyPrecedes method to test which array of integers comes first in a lexicographical ordering.
ja: この例はlexicographicallyPrecedesメソッドを使って、どの整数配列がある語彙筆記的順序において最初に来るかをテストします。

source: This example uses the negate() method to negate the value of the variable x:
ja: この例はnegate()メソッドを使って、変数xの値を負にします：

source: This example uses the conditional downcast operator (as?) to conditionally cast the s constant declared above to an instance of Swift’s String type.
ja: この例は、条件ダウンキャスト演算子（as?）を使って、上で定義されるs定数をSwiftのString型へ条件付きでキャストします。

source: This example uses the subscript with a message to use in case an HTTP response code isn’t recognized:
ja: この例は、添え字を、HTTP応答コードが識別されない場合に使うあるメッセージとともに使います：

source: This exponential growth strategy means that appending an element happens in constant time, averaging the performance of many append operations.
ja: この指数成長戦略は、ある要素を加えることは、多くの追加操作の遂行を平均すると、定数時間に起こることを意味します。

source: This file is an Objective-C header that declares the Swift interfaces in your target, and you can think of it as an umbrella header for your Swift code.
ja: このファイルは、Swiftインターフェイスをあなたのターゲットにおいて宣言するObjective-Cヘッダです、そしてあなたはそれをあなたのSwiftコードのためのアンブレラファイルとみなせます。

source: This function can be used to replace many cases that were previously handled using C-style for loops.
ja: この関数は、C形式のforループを使用して前もって取り扱われたケースの多くを置き換えるのに使われることができます。

source: This function can be used to replace many instances of AnyIterator that wrap a closure.
ja: この関数は、クロージャをラップするAnyIteratorの多くのインスタンスを置き換えるのに使用できます。

source: This function does not modify object; the use of inout is an implementation artifact.
ja: この関数はobjectを修正しません；inoutの使用は、技巧上の実装です。

source: This function does not infer element moves.
ja: この関数は、要素が移動することを推測しません。

source: This function is the only requirement of the Comparable protocol.
ja: この関数は、Comparableプロトコルのただ１つの要件です。

source: This function returns immediately and never suspends.
ja: この関数は、直ぐに返ります、そして決して中断しません。

source: This function throws an error if any values are invalid for the given encoder’s format.
ja: この関数は、与えられたエンコーダの形式に対して何らかの値が無効であるならばエラーをスローします。

source: This function trades safety for performance.
ja: この関数は性能と安全を交換します。

source: This function uses the least specific nonmatching property of the date to determine the result of the comparison.
ja: この関数は、比較の結果を判定するのに、最小量となる特定の不一致日付プロパティを使います。

source: This function’s effects vary depending on the build flag used:
ja: この関数の効果は使用されるビルドフラグに依存して多様に異なります：

source: This includes characters used both as letters and commonly in mathematical formulas.
ja: これは、表音文字としてそして一般に数学公式においての両方で使われる表意文字を含みます。

source: This information is subject to change, and software implemented according to this documentation should be tested with final operating system software.
ja: この情報は変更される場合があり、この文書に沿って実装されるソフトウェアは最終的なオペレーティングシステム・ソフトウェアでテストされなければなりません。

source: This initializer does not perform any range or overflow checking.
ja: このイニシャライザは、全く範囲またはオーバーフロー検査を実行しません。

source: This initializer implements the scaleB operation defined by the IEEE 754 specification.
ja: このイニシャライザは、IEEE 754仕様で定義されるscaleB演算を実装します。

source: This initializer implements the IEEE 754 copysign operation.
ja: このイニシャライザは、IEEE 754 copysign演算を実装します。

source: This initializer is case sensitive.
ja: このイニシャライザは、大文字小文字を区別します。

source: This initializer is equivalent to init(from:).
ja: このイニシャライザは、init(from:)に等しいです。

source: This initializer is equivalent to the following calculation, where ** is exponentiation, computed as if by a single, correctly rounded, floating-point operation:
ja: このイニシャライザは次の計算に相当し、そこで**は乗算で、まるで単精度の、正しく丸められた、浮動小数点演算のように計算されます：

source: This initializer throws an error if reading from the decoder fails, or if the data read is corrupted or otherwise invalid.
ja: このイニシャライザは、デコーダからの読み出しが失敗するならば、または読み込んだデータが不正またはそうでなくとも無効ならば、エラーをスローします。

source: This initializer works with any type, and uses the custom debugDescription property for types that conform to CustomDebugStringConvertible:
ja: このイニシャライザはどんな型とでも働きます、そしてあつらえのdebugDescriptionプロパティをCustomDebugStringConvertibleに準拠する型に対して使います：

source: This initializer works with any type, and uses the custom description property for types that conform to CustomStringConvertible:
ja: このイニシャライザはどんな型とでも働きます、そしてあつらえのdescriptionプロパティをCustomStringConvertibleに準拠する型に対して使います：

source: This is almost certainly not what you want.
ja: これはほとんど疑いなくあなたが望むことではありません。

source: This is distinct from the Cocoa pattern—described above—that uses a trailing NSError parameter to indicate recoverable errors that you plan for during development.
ja: これは、— 上で記述される — Cocoaパターンとは別個のものです、それは後に続くNSErrorパラメータを使って、あなたが開発の間に対策を立てる解決可能なエラーを指し示します、

source: This is equivalent to initializing with an empty array literal.
ja: これは空の配列リテラルで初期化するのに等しいです。

source: This is equivalent to the inverse of a set.
ja: これはある集合の逆と等しいです。

source: This is inherently unsafe; UnsafeMutablePointer assumes the referenced memory has +1 strong ownership semantics, whereas AutoreleasingUnsafeMutablePointer implies +0 semantics.
ja: これは、本質的に安全ではありません；UnsafeMutablePointerは参照されるメモリが+1の強力な所有権意味論を持つことを仮定します、そういうわけでAutoreleasingUnsafeMutablePointerは必然的に+0意味論です。

source: This is itended to be used to allow callback or delegation based APIs to participate with async/await.
ja: これは、API基盤のコールバックまた委任が非同期／待機で参加するのを許可するために使われることを意図されます。

source: This is the default implementation of the greater-than operator (>) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きい演算子（>）の初期状態の実装です。

source: This is the default implementation of the greater-than-or-equal-to operator (>=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きいか等しい演算子（>=）の初期状態の実装です。

source: This is the default implementation of the less-than-or-equal-to operator (<=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より少ないか等しい演算子（<=）の初期状態の実装です。

source: This is the default implementation of the not-equal-to operator (!=) for any type that conforms to Equatable.
ja: Equatableに準拠するあらゆる型に対して、不等演算子（!=）の初期状態の実装です。

source: This is the unit of the least significant digit in this value’s significand.
ja: これはこの値の仮数の中の最下位数の単位です。

source: This iterator calls next() on its base iterator and evaluates the result with the predicate closure.
ja: このイテレータは、next()をそれの基底イテレータ上で呼び出します、そして結果をpredicateクロージャで評価します。

source: This iterator calls next() on its base iterator; if this call returns nil, next() returns nil.
ja: このイテレータは、next()をそれの基底イテレータ上で呼び出します；この呼び出しがnilを返すならば、next()はnilを返します。

source: This iterator forwards its next() method to an arbitrary underlying iterator having the same Element type, hiding the specifics of the underlying IteratorProtocol.
ja: このイテレータは、それのnext()メソッドを同じElement型を持っている随意の基盤をなすイテレータに転送して、特定の基盤をなすIteratorProtocolを隠しています。

source: This magnitude calculation takes the following form for a floating-point value x of type F, where ** is exponentiation:
ja: この規模計算は、型Fの浮動小数点値xに対して以下の形式をとります、そこで**は冪演算です：

source: This makes creating mixed-language app and framework targets as straightforward as creating an app or framework target written in a single language.
ja: これは、混合言語のアプリとフレームワーク・ターゲットを作成することを、単一の言語で書かれるアプリまたはフレームワーク・ターゲットをつくるのと同じくらいわかりやすいものにします。

source: This means that any cleanup state can be emitted accordingly in the cancellation handler
ja: これは、あらゆるクリーンアップ状態が取り消しハンドラの中でふさわしく発布されることが可能なことを意味します。

source: This means that any cleanup state can be emitted accordingly in the cancellation handler.
ja: これは、あらゆるクリーンアップ状態が取り消しハンドラの中でふさわしく発布されることが可能なことを意味します。

source: This means that if an array is sharing storage with other copies, the first mutating operation on that array incurs the cost of copying the array.
ja: これが意味するのは、ある配列がストレージを他のコピーと共有するならば、その配列上での最初の変更操作は、配列をコピーするコストを招くということです。

source: This means that when two different class instances have the same value for each of their stored properties, they're still considered to be different by the identity operator (===).
ja: これは、２つの異なるクラスインスタンスが同じ値をそれらの格納プロパティの各々に対して持つ場合に、それらはまだ異なっていると同一性演算子（===）によってみなされることを意味します。

source: This means the outer for await in loop iterates over String instances instead of the underlying Int values that Counter produces.
ja: これは、外側のfor await inループがStringインスタンスそれらのすべてにわたって反復することを意味します、Counterが生み出す基礎をなすIntそれらではなく。

source: This means the outer for await in loop iterates over String instances instead of the underlying Int values that Counter produces:
ja: これは、外側のfor await inループがStringインスタンスそれらのすべてにわたって反復することを意味します、Counterが生み出す基礎をなすIntそれらではなく：

source: This method ensures that the array has unique, mutable, contiguous storage, with space allocated for at least the requested number of elements.
ja: このメソッドは、配列が、少なくとも要請された数の要素に割り当てられた空間とともに、固有な、可変の、隣接するストレージを持つことを保証します。

source: This method ensures that the dictionary has unique, mutable, contiguous storage, with space allocated for at least the requested number of key-value pairs.
ja: このメソッドは、辞書が、少なくとも要請された数のキー値ペアに割り当てられた空間とともに、固有な、可変の、隣接するストレージを持つことを保証します。

source: This method has the effect of removing the specified range of elements from the array and inserting the new elements at the same location.
ja: このメソッドは、指定された範囲の要素を配列から取り除き、そして新しい要素を同じ場所に挿入する効果を持ちます。

source: This method has the effect of removing the specified range of elements from the collection and inserting the new elements at the same location.
ja: このメソッドは、指定された範囲の要素をコレクションから取り除き、そして新しい要素を同じ場所に挿入する効果を持ちます。

source: This method implements the mathematical notion of lexicographical ordering, which has no connection to Unicode.
ja: このメソッドは、語彙筆記的順序の数学的概念を実装します、それはユニコードに関係はありません。

source: This method implements the remainder operation defined by the IEEE 754 specification.
ja: このメソッドは、IEEE 754 仕様によって定義される剰余演算を実装します。

source: This method is equivalent to calling Bool.random(using:), passing in the system’s default random generator.
ja: このメソッドは、Bool.random(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling random(in:using:), passing in the system’s default random generator.
ja: このメソッドは、random(in:using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling randomElement(using:), passing in the system’s default random generator.
ja: このメソッドは、randomElement(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling shuffle(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffle(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling shuffled(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffled(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling the version that takes a generator, passing in the system’s default random generator.
ja: このメソッドは、ある生成子をとるバージョンを、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to the C fma function and implements the fusedMultiplyAdd operation defined by the IEEE 754 specification.
ja: このメソッドは、C fma関数の等価物です、そしてfusedMultiplyAdd演算を実装し、それはIEEE 754仕様によって定義されます。

source: This method is preferred over reduce(_:_:) for efficiency when the result is a copy-on-write type, for example an Array or a Dictionary.
ja: このメソッドは、効率のためにreduce(_:_:)より好まれます、その結果がコピーオンライト型である場合、例えばArrayまたは辞書に対しては。

source: This method must not be called after a call to container(keyedBy:) or after encoding a value through a call to singleValueContainer()
ja: このメソッドは、container(keyedBy:)への呼び出しの後、またはsingleValueContainer()への呼び出しを通して値をエンコードする後に呼び出されてはなりません

source: This method must not be called after a call to unkeyedContainer() or container(keyedBy:), or after encoding a value through a call to singleValueContainer()
ja: このメソッドは、unkeyedContainer()やcontainer(keyedBy:)への呼び出しの後、またはsingleValueContainer()への呼び出しを通して値をエンコードする後に呼び出されてはなりません

source: This method must not be called after a call to unkeyedContainer() or after encoding a value through a call to singleValueContainer()
ja: このメソッドは、unkeyedContainer()への呼び出しの後、またはsingleValueContainer()への呼び出しを通して値をエンコードする後に呼び出されてはなりません

source: This method returns true and false with equal probability.
ja: このメソッドは、trueとfalseを等しい確率で返します。

source: This method returns the maximum of two values, preserving order and eliminating NaN when possible.
ja: このメソッドは、２つの値のうち最大を返します、可能な場合は桁数の保全およびNaNの排除をします。

source: This method returns the minimum of two values, preserving order and eliminating NaN when possible.
ja: このメソッドは、２つの値のうち最小を返します、可能な場合は桁数の保全およびNaNの排除をします。

source: This method returns the value with greater magnitude of the two given values, preserving order and eliminating NaN when possible.
ja: このメソッドは、２つの与えられた値のうちより大きい規模を持つ値を返します、可能な場合は桁数の保全およびNaNの排除をします。

source: This method returns the value with lesser magnitude of the two given values, preserving order and eliminating NaN when possible.
ja: このメソッドは、２つの与えられた値のうちより小さい規模を持つ値を返します、可能な場合は桁数の保全およびNaNの排除をします。

source: This method serves as the basis for the equal-to operator (==) for floating-point values.
ja: このメソッドは、浮動小数点値のための同等演算子（==）の基盤としての機能を果たします。

source: This method serves as the basis for the less-than operator (<) for floating-point values.
ja: このメソッドは、浮動小数点値のためのより少ない演算子（<）の基盤としての機能を果たします。

source: This method serves as the basis for the less-than-or-equal-to operator (<=) for floating-point values.
ja: このメソッドは、浮動小数点値のためのより少ないか等しい演算子（<=）の基盤としての機能を果たします。

source: This operator tests whether two instances have different identities, not different values.
ja: この演算子は、２つのインスタンスが異なる正体を持つ（異なる同一性を持つ）かどうかをテストします、異なる値をではなく。

source: This operator tests whether two instances have the same identity, not the same value.
ja: この演算子は、２つのインスタンスが同じ正体を持つ（同一性を持つ）かどうかをテストします、同じ値をではなく。

source: This operator uses short-circuit evaluation: optional is checked first, and defaultValue is evaluated only if optional is nil.
ja: この演算子は、短絡評価を使います：optionalが最初に調べられます、そしてdefaultValueはoptionalがnilである場合にのみ評価されます。

source: This operator uses short-circuit evaluation: The left-hand side (lhs) is evaluated first, and the right-hand side (rhs) is evaluated only if lhs evaluates to false.
ja: この演算子は、短絡評価を使います：左手側（lhs）が最初に評価されます、そして右手側（rhs）はlhsがfalseに評価する場合にのみ評価されます。

source: This operator uses short-circuit evaluation: The left-hand side (lhs) is evaluated first, and the right-hand side (rhs) is evaluated only if lhs evaluates to true.
ja: この演算子は、短絡評価を使います：左手側（lhs）が最初に評価されます、そして右手側（rhs）はlhsがtrueに評価する場合にのみ評価されます。

source: This postcondition must hold even if the initializer closure throws an error.
ja: この事後条件は、たとえinitializerクロージャがエラーをスローするとしても保持されなければなりません。

source: This property corresponds to the “Math” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Math” に相当します。

source: This property has the same value as the description property, except that NaN values are printed in an extended format.
ja: このプロパティは、descriptionプロパティと同じ値を持ちます、NaN値が拡張フォーマットにおいて出力されることを除いて。

source: This property implements the logB operation defined by the IEEE 754 specification.
ja: このプロパティは、IEEE 754仕様で定義されるlogB演算を実装します。

source: This property is true for both quiet and signaling NaNs.
ja: このプロパティは、クワイエットおよびシグナルNaNの両方に対してtrueです。

source: This property is true only for characters composed of scalars in the “Math_Symbol”, “Currency_Symbol”, “Modifier_Symbol”, or “Other_Symbol” categories in the Unicode Standard.
ja: このプロパティがtrueであるのは、Unicode Standardにおける “Math_Symbol”、“Currency_Symbol”、“Modifier_Symbol”、または“Other_Symbol” カテゴリの中のスカラーから構成される文字に対してのみです。

source: This property is a constant for instances of fixed-width integer types.
ja: このプロパティは、固定長整数型のインスタンスのための定数です。

source: This property is a “past the end” index that does not correspond with any element of the collection.
ja: このプロパティは「終わりを過ぎた」インデックスで、それはコレクションのどの要素にも対応しません。

source: This property is always true for signed integer types.
ja: このプロパティは、符号付き整数型に対して常にtrueです。

source: This property must always evaluate to the same executor for a given actor instance, and holding on to the actor must keep the executor alive.
ja: このプロパティは、与えられたアクターインスタンスに対して常に同じエグゼキュータに評価されなければなりません、そしてアクターを手放さないことはエグゼキュータを存続させる必要があります。

source: This property will be implicitly accessed when work needs to be scheduled onto this actor.
ja: このプロパティは、仕事がこのアクター上に予定を組まれる必要がある時に、暗黙的にアクセスされます。

source: This relation is a refinement of the less-than-or-equal-to operator (<=) that provides a total order on all values of the type, including signed zeros and NaNs.
ja: この関係は、より少ないか等しい演算子（<=の改良版です、それは、符号付きゼロとNaNを含む、その型のすべての値に関する全順序を提供します。

source: This returns an instance of type AsyncIterator.
ja: これは、型AsyncIteratorのあるインスタンスを返します。

source: This rounding rule is also known as “bankers rounding,” and is the default IEEE 754 rounding mode for arithmetic.
ja: この丸め規則はまた「銀行家の丸め」としても知られます、そして算術に対する省略時のIEEE 754丸め方式です。

source: This rounding rule is also known as “schoolbook rounding.” The following example shows the results of rounding numbers using this rule:
ja: この丸め規則はまた「教科書丸め」としても知られます。以下の例は、この規則を使っての数の丸めの結果を示します：

source: This rule implements the roundToIntegralTiesToEven operation defined by the IEEE 754 specification.
ja: この規則は、IEEE 754仕様で定義されるroundToIntegralTiesToEven演算を実装します。

source: This rule is equivalent to the C ceil function and implements the roundToIntegralTowardPositive operation defined by the IEEE 754 specification.
ja: この規則は、C ceil関数の等価物です、そしてIEEE 754仕様によって定義されるroundToIntegralTowardPositive演算を実装します。

source: This rule is equivalent to the C floor function and implements the roundToIntegralTowardNegative operation defined by the IEEE 754 specification.
ja: この規則は、C floor関数の等価物です、そしてroundToIntegralTowardNegative演算を実装し、それはIEEE 754仕様によって定義されます。

source: This rule is equivalent to the C round function and implements the roundToIntegralTiesToAway operation defined by the IEEE 754 specification.
ja: この規則は、C round関数の等価物です、そしてIEEE 754仕様によって定義されるroundToIntegralTiesToAway演算を実装します。

source: This rule is equivalent to the C trunc function and implements the roundToIntegralTowardZero operation defined by the IEEE 754 specification.
ja: この規則は、C trunc関数の等価物です、そしてroundToIntegralTowardZero演算を実装し、それはIEEE 754仕様によって定義されます。
